{
  "0": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Pro Filt’r Instant Retouch Longwear Liquid Concealer",
      "We're Even Hydrating Longwear Waterproof Concealer",
      "Pro Filt'r Instant Retouch Setting Powder"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Dry"
    ],
    "examples": [
      "Good colour match with medium coverage. and didn't crease on me as much as the Pro Filt’r Instant Retouch Longwear Liquid Concealer. \n\nCannot be layered over the Pro Filt'r Powder Foundation or it splits, so don't miss any spots.",
      "The warm undertones complement my skin perfectly. Its hydrating formula provides long-lasting coverage without feeling heavy. The waterproof feature is a bonus, making it ideal for all-day wear. Rihanna's Fenty Beauty continues to impress with quality products that cater to diverse skin tones.",
      "I have very oily skin and fenty never adds more oil into it nor does it dry up my skin as other brands do"
    ],
    "cluster_size": 2215,
    "avg_rating": 3.79
  },
  "1": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Lux Balm Ultra-Hydrating Cherry Lip Balm",
      "Cherriez Gone Bad Hydrating Lip Care Duo + Keychain"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Normal"
    ],
    "examples": [
      "Smells exactly like cherries I love it! The grit in the formula is so nice for exfoliating the lips while hydrating too!",
      "Smells like any other cherry chapstick. Very thin consistency. I like the packaging",
      "Really noticeably grainy and couldn’t really get past that bc there’s nothing special about it, no detectable scent. Grainy drugstore lip balm in fancy Fenty packaging sold at Sephora for $16…"
    ],
    "cluster_size": 305,
    "avg_rating": 3.31
  },
  "2": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Invisimatte Instant Setting + Blotting Powder",
      "Pro Filt'r Instant Retouch Setting Powder"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Dry"
    ],
    "examples": [
      "Not worth the price, the applicator is like from the dollar store and if you have a darker tone it leaves a white film. Better off purchasing other blot powders. This is worth $15 or less. Very disappointed with this purchase.",
      "I loooooove this powder. It blurs pores and keeps shine at bay for a full 8 hours. Reapplication is not cakey at all and refreshes the look of make up. I also use this to set my concealer under my eyes for a brightening effect and it doesn’t creases.",
      "Don’t even do it - especially women of color. The white doesn’t absorb into current makeup and it looks like a white powder film when using the applicator it comes with"
    ],
    "cluster_size": 448,
    "avg_rating": 4.04
  },
  "3": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Match Stix Shimmer Skinstick"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Oily"
    ],
    "examples": [
      "Greasy, purple mess!! I did not like the formula of the match stix nor the colors.",
      "This formula has got to go! While very pigmented , the stick is a little too powdery and tends to be dry making it hard to blend. If you are not careful your application may look streaky or harsh. It does have a bit of sparkle so if you are not a fan of glitter I would stay away. There is not a ton of product either, but is small enough to fit in a makeup bag or purse on the go. I however would not consider repurchasing in the future.",
      "love this blush! leaves a glowy pink color:) i put this on in the morning and it stays for about 5 hours which is nice:) it dosent break me out and feels light on the skin."
    ],
    "cluster_size": 1356,
    "avg_rating": 4.33
  },
  "4": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Cocoa Cleans'r Soothing All-Over Cleansing Bar",
      "The Fenty Skin Soap Dish"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Normal"
    ],
    "examples": [
      "This is a wonderful soap bar. Very refreshing scent and cleansing, but as a word of caution DO NOT use it for your face. The formula is too so drying and I felt my eyelids were on FIRE, which is the first time I've ever experienced that even as someone who experiments relatively frequently with facial soaps. \n\nI initially bought the sampler pack with the 2 small bars and the carrier. Sucks that the regular sized bar won't fit..kind of a waste because I don't always keep buying sample sizes repea",
      "I love this soap. I wear a lot of oils, lotions and fragrances, so I like the way this soap takes off the layers of oils and dirt from my skin. Then i go in with a moisturizing body wash.",
      "My husband brought this for us last year January when we moved together, and after a full year use this bar to wash our face everyday, it's still there😂half gone, but that is just crazy long-lasting. I have dry skin and he has oily skin but we both have no problem use this everyday. Great product."
    ],
    "cluster_size": 377,
    "avg_rating": 4.12
  },
  "5": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Sun Stalk'r Instant Warmth Bronzer"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Oily"
    ],
    "examples": [
      "India Sun is the perfect bronzer for my fair neutral skin tone! I’ve been searching for the ultimate bronzer shade for YEARS and am so glad I found this! It looks natural on my skin, blends well, and doesn’t cause breakouts. Highly recommend!",
      "if I there were ten stars I'd give it a 10!! Seriously, this bronzer has changed my whole contour game, naturally. The finish is sooo perfect - pair this with the FENTY Bronzer Stixxx (Sinamon) adds the perfect shine to the cheek.",
      "you gotta be translucent for this color to show up on your skin lol. im super pale and it takes 20 dips in the pan to show up. BUT the formula is smooth and easily blendable.  I think i’ll be repurchasing a shade darker."
    ],
    "cluster_size": 56,
    "avg_rating": 4.8
  },
  "6": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Cookies N Clean Whipped Clay Pore Detox Face Mask with Salicylic Acid + Charcoal",
      "Cookies N Clean Whipped Clay Intensive Pore + Blackhead Face Scrub with Volcanic Sand + Charcoal"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Dry"
    ],
    "examples": [
      "Nooooooo, I wanted this to work so bad, but it's not sensitive, acne prone skin friendly. Immediate breakout formula. Each time I wanna give it another chance, it gives me more breaks out agin overnight. It does clean the skin, but at what cost? The enzyme exfoliator works much better.",
      "This product looks awesome on surface level- loved the presentation and packaging. The icing-shaped cap was also super fun. However the product just didn’t work for me. My forehead actually started breaking out more after using this. Super disappointed.",
      "I need to reorder this mask. I have used a lot of masks over the years but this one tops. It’s gentle but effective."
    ],
    "cluster_size": 569,
    "avg_rating": 4.59
  },
  "7": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Cookies N Clean Whipped Clay Intensive Pore + Blackhead Face Scrub with Volcanic Sand + Charcoal"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Normal"
    ],
    "examples": [
      "this is without a doubt the BEST face scrub i’ve ever used!! i’ve struggled to find a good face wash/scrub for myself for a really long time because of my weird combination of oily and dry skin on my face, especially because so many just make you break out even worse if you don’t use it at least 2 or 3 times a day. but because this Cookies n Clean Whipped Clay Face Scrub by Fenty even instructs you to use it just a few times a WEEK, it works so incredibly well with my skin! since starting to use",
      "I had stopped using physical exfoliation for a minute due to how it can potentially be harmful to your skin. But I did miss how scrubs could really help my skin with blackheads and texture. I was really glad to try this as I already have her Cookies and Clean face mask, which I love. This is a really good scrub and it's not too abrasive for my sensitive skin. It really leaves your face clean and it doesn't cause drying on the skin either. I like it!",
      "After using this for a week I can see that my pores are shrinking.  A little goes a long way."
    ],
    "cluster_size": 284,
    "avg_rating": 4.56
  },
  "8": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Pro Filt'r Instant Retouch Setting Powder",
      "Invisimatte Instant Setting + Blotting Powder"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Dry"
    ],
    "examples": [
      "I’ve been looking for an under eye setting powder because my current one by Laura Mercier creates lines around my eyes. I love Fenty especially the highlight and contour sticks. I’m 45 and this is actually worse under the eyes than my all over fave powder. It makes my eyes look extra crepey and dry. Maybe this works for younger people but I do not recommend it for the 40+ crowd.",
      "Amazing on oily skin!!! Literally makes my under eye soooooo flawless and airbrushed!!!  I would set with a pressed powder before to prevent creasing",
      "LAVENDER!! It’s so much brightening under the eyes, never going back!!"
    ],
    "cluster_size": 2037,
    "avg_rating": 4.18
  },
  "9": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Cheeks Out Freestyle Cream Bronzer"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Oily"
    ],
    "examples": [
      "This did not blend on my skin at all, and wound up looking like patches of dirt on my face. This is definitely a contour, not a bronzer. Using a thin brush I was able to sculpt my nose, but it never worked on my face or cheeks.",
      "I have pink toned, pale skin. Most bronzers and contours pull very orange on me. This was the first one that looked good. I deducted a star bec this has no staying power. It was completely gone within a couple hours of application. Also returned.",
      "So natural and pretty! Obsessed! It melts into your skin and has the most natural sun kissed glow."
    ],
    "cluster_size": 690,
    "avg_rating": 4.29
  },
  "10": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Flash Nap Instant Revival Priming Eye Gel-Cream With Green Tea + Persian Silk Tree"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Oily"
    ],
    "examples": [
      "I’ve used half of the bottle so far and I haven’t seen much of a difference. I got better results using other products. It came in a set with the night time moisturizer (which I absolutely ADORE) so I figured it would be worth a shot to try out. Cheaper",
      "Love the product .. it not heavy , oily . Its just right . Love it to the fullest will be buying it over when im finish with mines",
      "This eye cream unfortunately does not live up to the hype. The cooling sensation feels nice in the morning but thankfully doesn’t last too long. Pills under makeup. Nothing special about this cream, not veryhydrating. Pills u"
    ],
    "cluster_size": 92,
    "avg_rating": 3.5
  },
  "11": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Cherry Dub BHA Toner with Salicylic Acid + Aloe Juice",
      "Cherry Dub Pore Purify’r Gel Cleanser"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Normal"
    ],
    "examples": [
      "I’m a fan! I love products that include BHAs or AHAs as I have texture. I have liked every product I have tried from the Cherry collection so I was excited to see there was a toner.",
      "This new toner is super hydrating thanks to the aloe juice and also does wonders at exfoliating thanks to the salicylic acid. All this makes it super effective as a toner! And such a great value as this beautiful bottle will last a long time!",
      "This product is really refreshing and I really like to use it under makeup, it gives me a great glow. It also keeps my skin pretty refreshed, which I always enjoy with a BHA toner."
    ],
    "cluster_size": 227,
    "avg_rating": 4.4
  },
  "12": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Cherry Dub Pore Purify’r Gel Cleanser"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Normal"
    ],
    "examples": [
      "I am beyond in love!!! I typically don't go for cleansers other than the typical cerave because of my sensitive skin but this product has been great!! Sweet cherry scent and easy pumping from its glass bottle.",
      "Best cleanser in the line up. Unfortunately only for oily skin. I’ll be switching to another brand until another cleanser just like this one is made for more balanced skin types (that is how good it is compared to the others)!",
      "I really enjoyed this face cleanser! It gets my skin clean feeling without being overly drying. It also smells so good, but not too overpowering!"
    ],
    "cluster_size": 307,
    "avg_rating": 4.6
  },
  "13": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Mini Instant Reset Brightening Overnight Recovery Gel-Cream With Niacinamide + Kalahari Melon Oil",
      "Instant Reset Brightening Overnight Recovery Gel-Cream With Niacinamide + Kalahari Melon Oil",
      "Instant Reset Brightening Overnight Recovery Gel-Cream with Niacinamide Refill"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Oily"
    ],
    "examples": [
      "so like everyone else i have been struggling with my skin because of the pandemic and having to wear a mask constantly. it’s been destroying my skin. the moment i saw fenty skin drop i knew i needed to try it. i genuinely love this line and the way it feels on my skin\n\nhowever, i have now been using fenty skin for 4 months and have not seen the results i wanted. trust me, i wanted this skincare line to work for me so badly, but it’s just not meant to be for me. i think my skin is reacting poorly",
      "This smelled like mildew. I love Fenty products but the smell of this was just too much. I could not stand it. I will be returning it.",
      "The review is only based on packaging and the amount not 50mL. Very disappointed. I will be calling the store. I am not a fan of the packaging seems cheap and flimsy. Maybe I am not putting it right but it always comes apart."
    ],
    "cluster_size": 145,
    "avg_rating": 2.08
  },
  "14": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Hydra Vizor Huez Tinted Moisturizer Broad Spectrum Mineral Spf 30 Sunscreen",
      "Hydra Vizor Mineral SPF 30 Refillable Moisturizer"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Normal"
    ],
    "examples": [
      "This felt really heavy and thick on application - I applied a lighter weight moisturizer on top of it to actually feel like my skin was hydrated. The tint makes it work well on darker skin with no white cast which is great for a mineral sunscreen.  But I'm going back to my clinique SPF 50",
      "Used this for over a year now and I'm still obsessed.",
      "I honestly like this product but I do not love it. Upon application, it feels kind of heavy. I do not find this product to be buildable but it is hydrating. If it were any heavier, it would be almost too oily for my skin type. However, I do like the light coverage of this product. It does help to hide minor imperfections and gives your skin an even surface or a nice glow. I do like that this is a SPF tinted moisturizer that does not leave any white cast."
    ],
    "cluster_size": 1287,
    "avg_rating": 4.34
  },
  "15": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Mini Fat Water Niacinamide Pore-Refining Toner Serum with Barbados Cherry"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Dry"
    ],
    "examples": [
      "this is one of the best toners I’ve ever used!!! this toner literally did everything. It said it wouldn’t. I love Fenty products !!! i got it as a sample ￼the  decided to purchase a full bottle. My skin is soooo  soft. It’s so clear it’s what else. ￼ it’s actually shrink my pores. ￼￼",
      "After using this product for a week felt amazingly soft.\nI felt my priests were getting tighter each time, thank you Fenty Skin!",
      "I wasn't much of a toner person but this product was the best thing I ever got. It was in the reward section so I got a mini sample. The smell gave me an instant fresh feeling and my pores have visibly shrunk. A little goes a long way. I ordered this toner and this will be something I'll always include in my skincare"
    ],
    "cluster_size": 37,
    "avg_rating": 4.41
  },
  "16": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Mini Total Cleans'r Makeup Removing Cleanser"
    ],
    "top_skin_types": [
      "Combination",
      "Normal",
      "Dry"
    ],
    "examples": [
      "I have used my cleanser but this is the best one. Loved it. It removed my makeup perfectly.",
      "This smells so good I can’t explain it. It leaves my skin feeling so smooth and soft. 10/10",
      "I was excited to try this cleanser created by the queen RiRi but it’s a no from me. My face didn’t feel clean after using this. I don’t feel like it did anything besides smell good (like warm vanilla) and I wouldn’t recommend or buy this again. Disappointing. I give it two starts because a little goes a long way and it smells good but there’s no real cleansing action going on. I got a lot of sebum buildup because it didn’t do much compared to my old cleanser. Hard pass."
    ],
    "cluster_size": 38,
    "avg_rating": 3.66
  },
  "17": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Instant Reset Brightening Overnight Recovery Gel-Cream With Niacinamide + Kalahari Melon Oil",
      "Mini Instant Reset Brightening Overnight Recovery Gel-Cream With Niacinamide + Kalahari Melon Oil",
      "Instant Reset Brightening Overnight Recovery Gel-Cream with Niacinamide Refill"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Normal"
    ],
    "examples": [
      "This product feels great on the skin once rubbed in but I can not get over how thick the cream is. I prefer the feel a softer cream when applying. Overall the product works well I had no breakouts, my skin felt soft and moisturized.",
      "I’ve never had an over night cream that has worked this well. Noticed results instantly. Almost finished my first container and have had so many complements on my skin. I have very dry skin in the winter… not anymore. Skin is brighter hydrated and dark patches are fading.",
      "literally dying over this stuff. my skin has been so dry and this instantly made it feel hydrated"
    ],
    "cluster_size": 332,
    "avg_rating": 4.84
  },
  "18": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Hydra Vizor Refillable Invisible Face Moisturizer SPF 30 with Niacinamide",
      "Hydra Vizor Mineral SPF 30 Refillable Moisturizer"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Normal"
    ],
    "examples": [
      "Hydra vizor invisible moisturizer SPF 30 gives a complete skincare step with natural look. The brand I used before from Korea beauty made my skin too white compare with other areas in the body. Also, the moisturizer is light texture therefore my skin can breathe and glowy. Highly recommended for a summer moisture with SPF.",
      "I've been using the Fenty Skin Hydra Vizor Invisible Moisturizer Broad Spectrum SPF 30 Sunscreen for a few weeks, and it has quickly become a staple in my skincare routine. The texture is light and silky, absorbing quickly without leaving a greasy residue, which is perfect for my combination skin. It provides a truly invisible finish, avoiding the dreaded white cast even on my medium skin tone, and leaves my skin with a hydrated, subtle glow. The light, pleasant fragrance adds a refreshing touch",
      "I truly can’t live without this product! It’s a 3 in 1 product: moisturizer, spf, and primer. It has a thick consistency and creates a beautiful glow. I love it and actually have a subscription for it, because it’s that good!"
    ],
    "cluster_size": 317,
    "avg_rating": 4.56
  },
  "19": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Travel-Size Start’r Set with Mineral SPF"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Dry"
    ],
    "examples": [
      "Love the travel package, handy and practical. I still could keep my face clean and moisturize.",
      "This is the second time I buy from this package.\nI bought two , additional on in black friday. I use it daily. It is gentle for my skin",
      "This was one of my first skincare sets from Sephora. Average products in my opinion. The cleanser was average and didn’t really do anything, the toner has witch Hazel so be aware if you have sensitive skin, and also the SPF is not too bad either"
    ],
    "cluster_size": 27,
    "avg_rating": 3.48
  },
  "20": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Mini Hydra'Reset Intensive Recovery Glycerin Hand Mask"
    ],
    "top_skin_types": [
      "Combination",
      "Normal",
      "Dry"
    ],
    "examples": [
      "Really impressed with this hand cream! It’s very moisturizing, it’s a tiny bit greasy but that’s how I know how it’s effective. Takes a little bit to sink in and a little goes a long way. Love that it’s very lightly scented!",
      "i need the full size to come back in stock because this hand cream is AMAZING. i bought it on a whim during the sale and i am obsessed. my hands have been so dry this winter and seemingly nothing could help...until this cream. one use and my hands were brand new! the texture is lovely and not greasy at all. fragrance is very minimal but pleasant. please never stop making this i will buy it forever!",
      "I've been using it off and on since november 2021. It does what it says but for me it's not like it keeps the hands moisturized all day. There's a citrussy scent. Someone else said the packaging chips and I thought it was just me. But it reqlly does peel (pill?) Kind of annoying when it sticks on your skin. Now i can't get  product out through squeezing so i cut and scoop from the middle."
    ],
    "cluster_size": 211,
    "avg_rating": 4.29
  },
  "21": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Pro Filt’r Soft Matte Longwear Powder Foundation"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Dry"
    ],
    "examples": [
      "This compact had a horrid smell. I had to return it.",
      "Why are all the shades leaving?? What is going on. Not going a 2 star because of anything that Sephora has done but Fenty help us out!! Most of the colors were removed from the stores, so I was ordering from the fenty site. Now my shade is continuously out of stock on the fenty site!! This is disappointing and irritating",
      "i broke out with cystic acne after switching to this foundation !! aah !! it had a nice, weightless finish and was matte too, so i feel bad... but there's painful inflammations on my cheeks. i didn't have a problem with acne when it came to other brands, so i'm going back to using saie."
    ],
    "cluster_size": 177,
    "avg_rating": 2.09
  },
  "22": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Pro Filt’r Soft Matte Longwear Powder Foundation",
      "We're Even Hydrating Longwear Waterproof Concealer"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Dry"
    ],
    "examples": [
      "Having tried numerous foundations in the past, I can confidently say that Fenty Foundation stands out from the crowd. Here's why:\n\n*Unmatched Performance: Fenty Foundation boasts an exceptional formula that effortlessly blends into the skin, providing a flawless and natural-looking finish. Unlike other products, it offers buildable coverage that caters to various skin tones and types, ensuring a perfect match for everyone.\n\n*Inclusive Shade Range: One of the standout benefits of owning Fenty Fou",
      "I'm very picky with my powders and this one is great. It blends well, doesn't make you look dry and lasts a while.",
      "I really like this foundation!  I have been a Mac Studio Fix powder foundation girl for well over a decade, and I must say I reach for the Fenty one most days instead. I have combination skin that leans drier as I’m getting older, and using Laniege’s Glowy Serum as a primer and using a brush for application and a sponge dampened with Fix plus to soften the powdery effect works for me. I set it lightly with Mac’s mineralized skinfinish (Sephora’s Micro Smooth Baked Powder works, too) and use Char"
    ],
    "cluster_size": 902,
    "avg_rating": 4.78
  },
  "23": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Hydra Vizor Mineral SPF 30 Refillable Moisturizer"
    ],
    "top_skin_types": [
      "Combination",
      "Normal",
      "Dry"
    ],
    "examples": [
      "I have used this product daily for years but the formula changed in the last year or so and it is not the same. Leaves my skin feeling oily and the moisturizer doesn’t work as well as it used to.",
      "This product completely dried out my skin making it flaky and patchy which was never an issue for me until i started using this. The consistency was too thick very clay like couldn’t even pump it out. I don’t recommend this product. Super disappointed.",
      "I loved this when it first came out. I have recently purchased it and the formula is not the same. The colour is like a warm peach and it used to be more lilac before. When I put it on it leaves a white cast and before it didn’t"
    ],
    "cluster_size": 209,
    "avg_rating": 1.49
  },
  "24": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Hydra Vizor Mineral SPF 30 Refillable Moisturizer",
      "Hydra Vizor Huez Tinted Moisturizer Broad Spectrum Mineral Spf 30 Sunscreen"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Normal"
    ],
    "examples": [
      "First off, I love the packaging. It looks so fancy. The texture is light, super absorbent, and DOESN'T leave a white cast! The scent is also amazing! \n\nThis is my introduction to fenty beauty and I'm hoping this is not the last!",
      "This is my first time trying the Fenty Skin Hydra Vizor and I already know it’s staying in my routine. The texture is super smooth and lightweight- feels more like a moisturizer than sunscreen. It blends in beautifully with zero white cast, and my skin looks glowy, not greasy.\n\nI also love that it’s refillable! The packaging is sleek, luxe, and easy to use—plus better for the environment. It’s giving glow, hydration, and sun protection all in one.",
      "I'm pleasantly surprised at this product. It makes my skin look so nice! Blurs my \"imperfections\" and leaves a beautiful glow from within look (not too shiny)."
    ],
    "cluster_size": 377,
    "avg_rating": 4.56
  },
  "25": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Blemish Defeat'r BHA Spot-Targeting Gel"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Dry"
    ],
    "examples": [
      "I saw reviews on tiktok and immediately went to purchase, however when I used it for the first time it only flaked off immediately after drying down, I attempted to put makeup over it like advertised for and it ruined my base",
      "First, I received this product for free in exchange for my honest review/feedback. And I’m so glad I got it free because I would have been upset spending my money on this. This product does absolutely nothing to help acne and does not look good under make up like it claims. I like the texture of it, reminds me of a silicone based primer and the applicator it nice. Other then that, that’s the only positives I can come up with. I used this for 2 months consistently and it just didn’t do anything.",
      "don’t recommend. leaves every patchy & nasty after will be returning"
    ],
    "cluster_size": 145,
    "avg_rating": 1.54
  },
  "26": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Pre-Show Glow Refillable Instant Retexturizing 10% AHA Treatment"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Oily"
    ],
    "examples": [
      "This is a quality product. Been using for 2 weeks and can see a noticeable difference in my skin - softness and tone are improved. Definitely don’t use more than twice per week. It’s small for a reason. A little goes a very long way. Only draw, it smells like perm like everyone is saying. However, it doesn’t linger and didn’t bother me that much.",
      "This is a small bottle and I’m not sure how long she will last.  Using it 2x week.  \nIt gives me newborn soft supple skin.  Only thing negative I can say.  It has a perm solution scent.  Taking me back to elementary school.  Getting a perm in my Granny’s kitchen.  If you don’t mind that … it’s bomb and I’m getting a back up!!",
      "I like this product so far. It definitely leaves your skin feeling baby soft and glowing. It also didn’t burn/sting at all, which is rare for me when I use AHA products! The test will be how it works over time.\n\nMy issue is not with the size and price. If you look up most of the AHAs Sephora sells, they are also 1oz in larger packaging and cost more than this (i.e. DE, Biossance, First Aid Beauty to name a few). I just don’t like the packaging. I wish it were a pump or pipet so you could ration "
    ],
    "cluster_size": 20,
    "avg_rating": 3.35
  },
  "27": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Pre-Show Glow Refillable Instant Retexturizing 10% AHA Treatment"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Dry"
    ],
    "examples": [
      "I actually really like this product so far. All you do is rinse your face with water then apply it to your face. This products helps to brighten your face. I use it in the morning when I look like I just got out of bed. I really like it so far. You only scrub the product on for 30-60 seconds which is easy to the in the morning. Overall I would definitely recommend this product.",
      "I received this product as part of a free sample program, I really like the way it makes my skin feel. It did not dry it out at all. It has also helped improve the texture of my skin. I am looking forward to continued results.",
      "Wow I wasn’t expecting much from this for the simple fact that I’ve been strugglinggggg to get my skin together for a while but this stuff does everting, literally magic in a bottle, directions are to use twice a week so I usually do Sunday and then Friday, I thought it would leave my skin with dry patches and  it didn’t! I use my normal moisturizer after this product and swear I feel like I’m glowing for real!"
    ],
    "cluster_size": 144,
    "avg_rating": 4.62
  },
  "28": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Mini Pro Filt'r Hydrating Primer"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Normal"
    ],
    "examples": [
      "I've always had an issue applying concealer around redness and under my eyes due to my combination skin being so dry in those areas, but using this product with a lot of moisturizer has made a huge difference! Feels silky and smooth, looks natural.",
      "This primer is beautiful in every way. I have dry skin and found it very hydrating, works very well under makeup, and the smell is devine!",
      "I just went back today to buy this in the full-size. My new go-to! I don’t notice a smell as some of the other reviewers mentioned - maybe that was fixed?"
    ],
    "cluster_size": 74,
    "avg_rating": 4.64
  },
  "29": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Mini Pro Filt'r Hydrating Primer"
    ],
    "top_skin_types": [
      "Combination",
      "Oily"
    ],
    "examples": [
      "Sorry rihanna. I love you, but this primer didnt work for me. Made my face oily and caked makeup within a few hours",
      "This primer works great---if you can handle the fragrance. I can't wear heavily fragranced things on my face. I tried this on my hand before my face--and after I washed my hands, I could still smell the scent. It's awful. It's unfortunate because I do like the way the primer works.",
      "No help as a primer. Just like a watery cream put on ur face. Do not recommend"
    ],
    "cluster_size": 17,
    "avg_rating": 1.82
  },
  "30": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Sun Stalk'r Instant Warmth Bronzer"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Dry"
    ],
    "examples": [
      "What is bronzer? THIS is bronzer! II use this to bring back warmth to my face after highlighting and colour correcting. A little goes a long way and the warm red undertones come through doubling as a blush. The deepness allows you to use it as a contour as well.",
      "Listen!!! I have had Mocha Mami in my staple for years (love the shade of course :) ) However this Thick Mint?! This shade better not be discontinued! I love that it bronzes me up with out the super warmness I get with Mocha Mami. Its neutral but not gray and doesn't make you look harsh either. Super pigmented, easy to blend, and not heavy. I feel that this shade looks more natural on me if it makes sense. Last, the packaging is perfect. I never had and issue if I missed and drop this product or",
      "I have Private Island and Shady Biz. Skin tone is light-medium with olive undertone. These bronzers are a must have. They wear all day, blend out with ease, and look gorgeous whether I am going for glam or natural makeup looks. I often use them as eye shadows as well for a quick monochromatic look. You won't regret the purchase!"
    ],
    "cluster_size": 64,
    "avg_rating": 4.53
  },
  "31": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "We're Even Hydrating Longwear Waterproof Concealer"
    ],
    "top_skin_types": [
      "Dry",
      "Combination",
      "Oily"
    ],
    "examples": [
      "I try to like it but I didn't, it blends easily, but it highlights my expression lines too much and looks very patchy on my face",
      "I was disappointed with this concealer. The formula is too liquidy and did not work well for me. Throughout the day, it would crease and separate under my eyes, making my makeup look uneven. It also tended to rub off easily, which made it hard to rely on for long wear. Unfortunately, it didn’t meet my ex vs",
      "I found this concealer to not be hydrating enough! I wanted to love it, but as soon I blended it out under my eyes and on top of my blemishes it was extremely patchy and drying. I always prep my face with moisturizer and primer as well, so I don’t think it’s my base making it dry."
    ],
    "cluster_size": 53,
    "avg_rating": 2.02
  },
  "32": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "We're Even Hydrating Longwear Waterproof Concealer"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Dry"
    ],
    "examples": [
      "Not hydrating. Does last long. Pills quite a bit over makeup. Not for people for dry to normal skin. Creases so fast with or without setting powder. Not worth the price.",
      "This product is really good and easy to cover up blemishes and under eyes but creases and with some setting powder gets grainy",
      "I like the coverage it offers for the under eye area as well as for spot concealing. It doesn’t stick too badly to dry patches, but it will crease if you don’t set it with powder. Unfortunately, the cap of the applicator wand has detached from the wand itself and now concealer leaks everywhere when I try and open it."
    ],
    "cluster_size": 18,
    "avg_rating": 3.61
  },
  "33": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "We're Even Hydrating Longwear Waterproof Concealer"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Normal"
    ],
    "examples": [
      "The most hydrating concealer I’ve ever owned! Even after wearing all day there is no cracking or flaking! I absolutely love it, goes on so smooth and covers every blemish seamlessly! Not to mention the shade match is perfect!!",
      "This is what Fenty shouldve dropped first because this product is amazing. I usually use hydrogrip under all my concealers, for context the consistency of this product is a tinted version of the hydrogrip under eye for simplicity. The formula is amazing!",
      "I'm absolutely thrilled with this concealer. Its velvety texture and second-skin finish are truly remarkable, making it a standout in my makeup routine. Getting great coverage in just one swipe is one of the things I love about it. The staying power is impressive, ensuring my look lasts throughout the day.\n\nWhat adds to the experience is the subtle coconut-like scent – a delightful bonus that enhances the application. It effectively tackles under-eye circles and blemishes without any heavy feeli"
    ],
    "cluster_size": 295,
    "avg_rating": 4.78
  },
  "34": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Blemish Defeat'r BHA Spot-Targeting Gel"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Normal"
    ],
    "examples": [
      "While I loved the concept of this product, I was hesitant to pull the trigger because the ads didn’t show anyone with actual blemishes and some reviews raised concern with it peeling. Overall though this product has  done just what I needed it to with the hormonal whiteheads on my chin. It creates a nice barrier so I don’t feel like I’m making the problem worse by clogging my pores with makeup. I’ve been able to avoid the peeling problem by 1) applying a thin layer to start 2) allowing time for ",
      "After using the products for a few weeks I am so happy with the results! There was no long dry time, didn’t leave a sticky feeling like most others I’ve tried, and it really works. I put it on the spots I feel a pimple coming and the next morning it’s smaller and less painful.",
      "After using this protect I see my dark spots fading and I really like the texture and the way it feels on my face it feels amazing."
    ],
    "cluster_size": 205,
    "avg_rating": 4.64
  },
  "35": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Blemish Defeat'r BHA Spot-Targeting Gel"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Oily"
    ],
    "examples": [
      "This gel did dry out my skin despite its claims otherwise. It also did not make blemishes less noticeable under makeup, compared to covering them without using the gel. It did help treat my acne, but it was a little slower than I’d have liked. Still, I understand that miracles are not possible, haha",
      "This product is perfect for using under your makeup or when your going out and about and want to protect a pimple or blemish. It can’t compare to pimple patches thought because there completely different. This one does not squeeze anything out of it . It just protects it. I do like the product thought but it can’t compare. ￼",
      "This product covers the blemish well under makeup, but it doesn’t help reduce or get rid of the blemish. You’re better off buying pimple patches."
    ],
    "cluster_size": 21,
    "avg_rating": 3.24
  },
  "36": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Sun Stalk'r Instant Warmth Bronzer"
    ],
    "top_skin_types": [
      "Combination",
      "Dry",
      "Oily"
    ],
    "examples": [
      "I love the red\nundertones on my stin\nit's so beautifur",
      "I love Fenty but this showed up really grey on my skin and didn’t look at all like it does in the packaging. I think it might suite someone with a cooler skin tone, I’m more tan with a yellow undertone.",
      "I was expecting more pigment. However, the color is pretty."
    ],
    "cluster_size": 123,
    "avg_rating": 2.56
  },
  "37": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Sun Stalk'r Instant Warmth Bronzer"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Dry"
    ],
    "examples": [
      "I haven’t used it yet but definitely looking forward to in the future.",
      "Amazing product. I have never found a bronzer until this one that looks good on my skin (light w/ cool or neutral undertones) without looking muddy, orange, glittery, or just like it’s not doing anything.  I just got it and it is already a needed everyday product.",
      "Great bronzer. One of my go to’s and such a natural shade as well (not orange)"
    ],
    "cluster_size": 859,
    "avg_rating": 4.83
  },
  "38": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Pro Filt'r Instant Retouch Primer"
    ],
    "top_skin_types": [
      "Combination",
      "Normal",
      "Dry"
    ],
    "examples": [
      "This product worked great for moisturizing, blurring, and evening out my skin. But unfortunately I cannot recommend it as the bottle, while gorgeous, is very impractical and wasteful. The pump does not get all the product out, and the lid does not come off, leaving a good amount of product to go to waste. It is not worth the $32 (US). I am also not a huge fan of the smell, but it did not cause any negative side affects on my skin, as do some other products with fragrance.",
      "I like the primer, but the packaging is horrible! I have about 3/4 of the bottle full but the pump stopped working and the top part doesn’t come off. I can’t use the remaining product, what a waste!",
      "I truly love this primer, but I get annoyed by how much product I waste because of the packaging. It's extremely difficult to get the cap off of the glass bottle and even more difficult to scrape the product out. I'm going to have to start shopping around for other primers, which breaks my heart because I love the actual primer!"
    ],
    "cluster_size": 25,
    "avg_rating": 2.8
  },
  "39": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Pro Filt'r Instant Retouch Primer",
      "Pro Filt'r Mattifying Primer",
      "Mini Pro Filt'r Mattifying Primer"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Normal"
    ],
    "examples": [
      "While I actually did not enjoy this, I am going to give it 3 stars because I think my skin type just isn't right for it. \nI don't have naturally oily skin, but as the day goes on and with heat, I often start looking more oily than dewy. I thought this would be perfect but it was just too drying. \nThe 'Instant Retouch' primer would probably be better for me, but I haven't tried it yet.",
      "Goes on nice and smooth, and looks great under foundation AT FIRST! However, after an hour or two it seems the foundation starts to slip off :( I was an oily mess after two hours!! And the foundation was coming off. I was very upset. I’ve worn this primer with the fenty beauty foundation twice and the same result occurs. I’ve worn the foundation before without the primer and it looked beautiful. I wish it would’ve worked since it smells so nice. I would skip on this one if you have oily skin. It",
      "With combo skin, the original Fenty Beauty primer works well.  I dont wear medium or full coverage foundation, but I do prep my skin & spot conceal, and was looking for this primer to help with my oily t-zone.  Fenty Beauty makeup artist Priscilla Ono recommends using the primers where you have trouble.  That's why I purchased this.  It was a big let down.  You could slip and slide down my t-zone after about 30 minutes.   Tried to give this another chance, next day it held up til about the 2nd h"
    ],
    "cluster_size": 491,
    "avg_rating": 2.13
  },
  "40": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Pro Filt'r Instant Retouch Primer",
      "Pro Filt'r Mattifying Primer",
      "Mini Pro Filt'r Mattifying Primer"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Normal"
    ],
    "examples": [
      "FENTY NEVER MISSES! some of the best primer I’ve ever used. It’s a perfect pair with the foundation which is my #1 foundation of all time.",
      "Okay, so this review is coming from a girl with ultra oily t-zone huge pores and dry patches. I started using this in August in Philly. So pretty humid, not perfect weather... pretty warm. I have to say, I have tried tonnns of primers. Fenty Beauty foundation definitely applies better on top of primer. My advice, give your face 20 seconds or so to let primer dry before moving to foundation. Same with moisturizer before priming. Always let product set! Anyway, I definitely notice a difference whe",
      "Pretty good Primer. It does a good job at smoothing and mattifying the skin. I do feel like there are other primers out there that have this same effect, i.e Wet n wild matte, but its a good option if you want the luxury of the glass packaging. My oilslick of a face ate right through it all within an hour but if youre looking for a smoothing and soft effect, this is the one. Personally prefer the Original Instant Retouch primer"
    ],
    "cluster_size": 1514,
    "avg_rating": 4.77
  },
  "41": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Pro Filt'r Mattifying Primer",
      "Mini Pro Filt'r Mattifying Primer"
    ],
    "top_skin_types": [
      "Oily",
      "Combination",
      "Normal"
    ],
    "examples": [
      "I have oily skin and can normally go about 2 hours without getting oily. I bought the original fenty primer and can wear that about 4 hours without getting oily so I thought this would extend that to around 6 hours. NOPE. It makes me super greasy and is actually worse than if I didn't use primer. My face is good for about 30 minutes and then it looks gross.",
      "I had a bad reaction to this product not sure if it was the combination of products but I would try it again.",
      "This product is amazing when it comes to the design, fragrance, texture, etc... but I’m so sad to say this primer do not work at all to keep my face from getting oily.  So bad that my face started getting shiny just in 20min time while I was still working on my eye makeup..... I love Fenty beauty and was so excited when this primer came out but this product don’t do its job for me.  Otherwise it smells great and I really love the silky texture."
    ],
    "cluster_size": 47,
    "avg_rating": 1.62
  },
  "42": {
    "summary": "",
    "top_brands": [
      "Fenty Beauty by Rihanna"
    ],
    "top_products": [
      "Pro Filt'r Mattifying Primer",
      "Mini Pro Filt'r Mattifying Primer"
    ],
    "top_skin_types": [
      "Combination",
      "Oily",
      "Normal"
    ],
    "examples": [
      "Very nice feeling on the skin keeps my skin Matt with out making it look super dry love it!",
      "Product is great! Light, blurs, smoothed! I used it alone without any other makeup and it made my skin look great!",
      "LOVE! Paired with the fenty pro filter for my oily skin is amazing! Super smooth skin! If I don't use it my foundation looks terrible"
    ],
    "cluster_size": 173,
    "avg_rating": 4.77
  }
}